## SQL And SQLite
SQL (Structured Query Language) is a standard language for managing and manipulating relational databases. SQLite is a self-contained, serverless, and zero-configuration database engine that is widely used for embedded database systems. In this lesson, we will cover the basics of SQL and SQLite, including creating databases, tables, and performing various SQL operations.

In [1]:
import sqlite3

In [2]:
#connect to sqlite3 database
connection = sqlite3.connect('example.db')
connection

In [3]:
#create cursor object
cursor = connection.cursor()
cursor

In [11]:
#Create a table
cursor.execute(
    ''' 
    CREATE TABLE IF NOT EXISTS Employees(
        id INTEGER PRIMARY KEY,
        name TEXT NOT NULL,
        age INTEGER,
        department TEXT
    )
    '''
)
connection.commit()

In [17]:
#Insert data in sqlite table
cursor.execute(
    ''' 
    INSERT INTO Employees(name, age, department)
    VALUES ('Pranoy', 25, 'Data Science'), ('Charlie', 25, 'Data Analytics'), ('Wanda', 32, 'Finance'), ('Bob', 35, 'Project Management')
    '''
)

connection.commit()

In [18]:
cursor.execute(
    ''' 
    SELECT * FROM Employees
    '''
)
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Pranoy', 25, 'Data Science')
(2, 'Charlie', 25, 'Data Analytics')
(3, 'Wanda', 32, 'Finance')
(4, 'Bob', 35, 'Project Management')

In [19]:
# Update the data in table
cursor.execute(
    ''' 
    UPDATE Employees
    SET age = 26
    WHERE name = 'Pranoy'
    '''
)
connection.commit()

In [21]:
cursor.execute(
    ''' 
    SELECT * FROM Employees
    WHERE name = 'Pranoy'
    '''
)
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Pranoy', 26, 'Data Science')

In [22]:
#delete the data
cursor.execute(
    ''' 
    DELETE FROM Employees
    WHERE name = 'Bob'
    '''
)
connection.commit()

In [23]:
cursor.execute(
    ''' 
    SELECT * FROM Employees
    '''
)
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Pranoy', 26, 'Data Science')
(2, 'Charlie', 25, 'Data Analytics')
(3, 'Wanda', 32, 'Finance')

#### Working Wwith Sales Data

In [25]:
connection = sqlite3.connect('sales.db')
cursor = connection.cursor()

In [26]:
#Create the table
cursor.execute(
    ''' 
    CREATE TABLE IF NOT EXISTS sales(
        id INTEGER PRIMARY KEY,
        date TEXT NOT NULL,
        product TEXT NOT NULL,
        sales INTEGER,
        region TEXT
    )
    '''
)

#insert data into sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany(
    ''' 
    INSERT INTO sales(date, product, sales, region)
    VALUES(?,?,?,?)
    ''', sales_data
)

connection.commit()

In [28]:
cursor.execute(
    ''' 
    SELECT * FROM sales
    '''
)
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [ ]:
cursor.execute(
    ''' 
    SELECT
        region, SUM(sales) AS total_sales
    FROM
        sales
    GROUP BY region
    ORDER BY total_sales DESC
    '''
)
rows = cursor.fetchall()
for row in rows:
    print(row)

('North', 400)
('West', 250)
('South', 200)
('East', 150)

In [33]:
import pandas as pd

In [34]:
df = pd.DataFrame(rows)
df

       0    1
0  North  400
1   West  250
2  South  200
3   East  150

In [35]:
#close the connection
connection.close()